---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeVertexArrayIterator.#ctor
source: html/e9c64954-ca21-71f2-0b8b-9824a9e2bd73.htm
---
# Autodesk.Revit.DB.SlabShapeVertexArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public SlabShapeVertexArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.